

CLASS_TO_CCRD = {
	'Castleman病': [
		'CCRD:16', # Castleman 病
	],

	'肥厚型心肌病': [],
	'Sack-Barabas综合征': [],


	'库欣综合征': [],
	'特发性肺动脉高压': [
		'CCRD:54', # 特发性肺动脉高压
	],
	'扩张型心肌病': [
		'CCRD:52.1', # 家族性/特发性扩张型心肌病
	],
	'Churg-Strauss综合征': [],
	'特纳综合征': [],
	'皮肤恶性黑色素瘤': [],
	'抗NMDAR受体脑炎': [
		'CCRD:9.1', # 抗 NMDAR 脑炎
	],
	'Cronkhite-Canada综合征': [],
	'SAPHO': [],
	'重症肌无力': [
		'CCRD:32', # 全身型重症肌无力
	],
	'POEMS综合症': [
		'CCRD:91', # POEMS 综合征
	],
	'先天性脊柱侧凸': [
		'CCRD:23', # 先天性脊柱侧凸
	],
	'烟雾病': [],
	'IgG4相关性疾病': [
		'CCRD:56', # IgG4 相关性疾病
	],
	'21-羟化酶缺乏': [
		'CCRD:1', # 21-羟化酶缺乏症
	],
	'原发性系统性淀粉样变性': [
		'CCRD:96', # 原发性轻链型淀粉样变
	],
	'直肠神经内分泌瘤': [],
	'Gitelman': [
		'CCRD:33', # Gitelman 综合征
	],
	'Fabry病': [
		'CCRD:27', # 法布雷病
	],
	'Bartter综合征': [],
	'蕈样肉芽肿': [],
	'Brugada综合征': [
		'CCRD:14.3', # Brugada综合征
	],
	'朗格汉斯细胞组织细胞增生症': [
		'CCRD:60', # LANGERHANS CELL HISTIOCYTOSIS
	],
	'限制性心肌病': [
		'CCRD:52.3', # 家族性/特发性限制型心肌病
	],
	'肝豆状核变性': [
		'CCRD:37', # 肝豆状核变性
	],
	'嗜酸性肉芽肿血管炎': [],
	'肺泡蛋白沉积症': [
		'CCRD:100', # 肺泡蛋白沉积症
	],
	'致心律失常性右室心肌病': [
		'CCRD:52.2', # 致心律失常性右室发育不良/心肌病（ARVD/C）
	],
	'McCune-Albright综合征': [
		'CCRD:69', # McCune-Albright 综合征
	],
	'心脏离子通道病（长QT间期综合征）': [
		'CCRD:14.1', # 长QT综合征
	],
	'Ehlers-Danlos综合征': [],
	'结节性硬化症': [
		'CCRD:114', # 结节性硬化症
	],
	'线粒体脑肌病': [
		'CCRD:72.1', # 线粒体脑肌病伴卒中样发作和乳酸酸中毒（MELAS）
		'CCRD:72.2', # 肌阵挛伴破碎红纤维 （MERRF）
		'CCRD:72.3', # Leigh 综合征
		'CCRD:72.4', # 慢性进行性眼外肌麻痹（CPEO）
		'CCRD:72.5', # 线粒体神经胃肠脑肌病（MINGIE）
		'CCRD:72.6', # Kearn–Sayre 综合征（KSS）
		'CCRD:72.7', # Pearson综合征
		'CCRD:72.8', # 神经原性肌无力，共济失调，视网膜色素变性（NARP）
		'CCRD:72.9', # Alpers-Huttenlocher综合征
	],
	'线粒体DNA缺失综合征': [],
	'Fanconi综合征': [],
	'CREST综合征': [],
	'系统性硬化症': [
		'CCRD:112', # 系统性硬化症
	],
	'着色性干皮病': [],

	# pumc_pk
	'Prader-Willi综合征': [
		'CCRD:93', # Prader-Willi 综合征
	],
	'马方综合征': [
		'CCRD:68', # 马方综合征
	],
	'肌萎缩侧索硬化': [
		'CCRD:4', # 肌萎缩侧索硬化
	],
	'多系统萎缩': [
		'CCRD:77', # 多系统萎缩
	],
	'Alport综合征': [
		'CCRD:3', # Alport 综合征
	],
	'阵发性睡眠性血红蛋白尿': [
		'CCRD:88', #
	],
	'尼曼匹克病': [
		'CCRD:82.1', # 尼曼匹克病A型
		'CCRD:82.2', # 尼曼匹克病B型
		'CCRD:82.3', # 尼曼匹克病C型
	],
	### todo 2020 11 27 增加协和MDT数据的诊断测试 ###
	'阴道闭锁': [],
	'家族性高胆固醇血症': [],
	# CRESR综合征 上面已经有
	'纯合子家族性高胆固醇血症': [
		'CCRD:46',
	],
	'PROTEASOME-ASSOCIATED AUTOINFLAMMATORY SYNDROME 2': [],
	'Activated PI3K-delta syndrome': [
		'CCRD:94', # 联合免疫缺陷疾病中的活化PI3K-δ综合征 为了增加可实验性，因为这一个只有orpha的 不能做测试

	],
	'Primary angiitis of the central nervous system': [],
	'粘多糖病第Ⅱ型': [],
	'戈谢病': [
		'CCRD:31',
	],
	'脊髓小脑性共济失调': [
		'CCRD:111',
	],
	'Nodular fasciitis': [],
	'高安动脉炎,无脉病,大动脉炎': [],
	'Aicardi Goutieres综合征': [],

	'缺铁性红细胞贫血伴b细胞免疫缺乏，周期性发烧和发育迟缓': [],

    #Castleman病 已经有了

	'先天性脂肪瘤样增生，血管畸形和表皮痣综合征': [],
	'先天性多发关节挛缩综合征': [],
	'macrodactyly': [],
	#McCune-Albright综合征 已经有了
	'肾上腺皮质癌': [],
	'Oncogenic osteomalacia': [],
	# 肌萎缩侧索硬化 上面已经有了
	# Fabry病 上面已经有了
	'红细胞生成性原卟啉病': [
		'CCRD:92',
	],
	'瓦登伯格综合征':[],
	# SAPHO 上面已经有了
	# APDS，Activated PI3K-delta syndrome 上面已经有了
	# 结节性硬化症 上面已经有了
	'Primary hypertrophic osteoarthropathy': [],
	'脊髓性肌萎缩症': [
		'CCRD:110',
	],

	# 蕈样肉芽肿 上面已经有了


	# 2020 11 30 为了做 CCRD所有疾病的测试 #
	#'21-羟化酶缺乏症': ['21-羟化酶缺乏症'],
	'白化病': [
		'CCRD:2',
	],
	#'Alport 综合征': [''],
	#'肌萎缩侧索硬化': [''],
	'天使综合征': [
		'CCRD:5',
	],
	'精氨酸酶缺乏症': [
		'CCRD:6',
	],



	#### 从这里开始 填充CCRD 全部 ###
	'窒息性胸腔失养症': [
		'CCRD:7',
	],
	'非典型溶血性尿毒症综合征': [
		'CCRD:8',
	],
	'自身免疫性脑炎': [
		'CCRD:9',
	],
	#'抗 NMDAR 脑炎': [''],
	'抗 LGI1 抗体相关脑炎': [
		'CCRD:9.2',
	],
	'自身免疫性垂体炎': [
		'CCRD:10',
	],
	'自身免疫性胰岛素受体病': [
		'CCRD:11',
	],
	'β-酮硫解酶缺乏症': [
		'CCRD:12',
	],
	'生物素酶缺乏症': [
		'CCRD:13',
	],
	#'长QT综合征': [''],
	'短QT综合征': [
		'CCRD:14.2',
	],
	#'Brugada综合征': [''],
	'儿茶酚胺敏感型多形性室性心动过速': [
		'CCRD:14.4',
	],
	'原发性肉碱缺乏症': [
		'CCRD:15'
	],
	#'Castleman 病': [''],
	'腓骨肌萎缩症': [
		'CCRD:17',
	],
	'瓜氨酸血症': [
		'CCRD:18',
	],
	'先天性肾上腺发育不良': [
		'CCRD:19',
	],
	'先天性高胰岛素性低血糖血症': [
		'CCRD:20',
	],
	'先天性肌无力综合征': [
		'CCRD:21',
	],
	'先天性肌强直': [
		'CCRD:22',
	],
	#'先天性脊柱侧凸': [''],
	'冠状动脉扩张': [
		'CCRD:24',
	],
	'先天性纯红细胞再生障碍性贫血': [
		'CCRD:25',
	],
	'Erdheim-Chester 病': [
		'CCRD:26',
	],
	#'法布雷病': [''],
	'家族性地中海热': [
		'CCRD:28',
	],
	'范可尼贫血': [
		'CCRD:29',
	],
	'半乳糖血症': [
		'CCRD:30',
	],
	#'戈谢病': [''],
	#'全身型重症肌无力': [''],
	#'Gitelman 综合征': [''],
	'戊二酸血症 I 型': [
		'CCRD:34.1',
	],
	'多种酰基辅酶 A 脱氢酶缺乏症': [
		'CCRD:34.2',
	],
	'糖原累积病Ia型': [
		'CCRD:35.1',
	],
	'糖原累积病Ib型': [
		'CCRD:35.2',
	],
	'糖原累积病II型': [
		'CCRD:35.3',
	],
	'血友病': [
		'CCRD:36',
	],
	#'肝豆状核变性': [''],
	'遗传性血管水肿': [
		'CCRD:38',
	],
	'单纯型大疱性表皮松解症': [
		'CCRD:39.1',
	],
	'交界型大疱性表皮松解症': [
		'CCRD:39.2',
	],
	'营养不良型大疱性表皮松解症': [
		'CCRD:39.3',
	],
	'遗传性果糖不耐受症': [
		'CCRD:40',
	],
	'遗传性低镁血症': [
		'CCRD:41',
	],
	'遗传性多发脑梗死性痴呆': [
		'CCRD:42',
	],
	'遗传性痉挛性截瘫': [
		'CCRD:43',
	],
	'全羧化酶合成酶缺乏症': [
		'CCRD:44',
	],
	'同型半胱氨酸血症': [
		'CCRD:45',
	],
	#'纯合子家族性高胆固醇血症': [''],
	'亨廷顿舞蹈病': [
		'CCRD:47',
	],
	'HHH 综合征': [
		'CCRD:48',
	],
	'高苯丙氨酸血症': [
		'CCRD:49',
	],
	'低磷酸酯酶症': [
		'CCRD:50',
	],
	'低血磷性佝偻病': [
		'CCRD:51',
	],
	#'家族性/特发性扩张型心肌病': [''],
	#'致心律失常性右室发育不良/心肌病': [''],
	#'家族性/特发性限制型心肌病': [''],
	'左室致密化不全': [
		'CCRD:52.4',
	],
	'遗传性转甲状腺素蛋白相关淀粉样变': [
		'CCRD:52.5',
	],
	'特发性低促性腺激素性性腺功能减退症': [
		'CCRD:53',
	],
	'卡尔曼综合征': [
		'CCRD:53.1',
	],
	#'特发性肺动脉高压': [''],
	'特发性肺纤维化': [
		'CCRD:55',
	],
	#'IgG4 相关性疾病': [''],
	'先天性胆汁酸合成障碍': [
		'CCRD:57',
	],
	'异戊酸血症': [
		'CCRD:58',
	],
	#'朗格汉斯细胞组织细胞增生症': [''],
	'莱伦综合征': [
		'CCRD:61',
	],
	'Leber 遗传性视神经病变': [
		'CCRD:62',
	],
	'长链 3 羟酰基辅酶 A 脱氢酶缺乏症': [
		'CCRD:63',
	],
	'淋巴管肌瘤病': [
		'CCRD:64',
	],
	'赖氨酸尿蛋白不耐受症': [
		'CCRD:65',
	],
	'溶酶体酸性脂肪酶缺乏症': [
		'CCRD:66',
	],
	'枫糖尿症': [
		'CCRD:67',
	],
	#'马方综合征': [''],
	#'McCune-Albright 综合征': [''],
	'中链酰基辅酶 A 脱氢酶缺乏症': [
		'CCRD:70',
	],
	'甲基丙二酸血症': [
		'CCRD:71',
	],
	#'线粒体脑肌病伴卒中样发作和乳酸酸中毒': [''],
	#'肌阵挛伴破碎红纤维': [''],
	#'Leigh 综合征': [''],
	#'慢性进行性眼外肌麻痹': [''],
	#'线粒体神经胃肠脑肌病': [''],
	#'Kearn–Sayre 综合征': [''],
	#'Pearson综合征': [''],
	#'神经原性肌无力，共济失调，视网膜色素变性',): [''],
	#'Alpers-Huttenlocher综合征': [''],
	'黏多糖贮积症': [
		'CCRD:73',
	],
	'多灶性运动神经病': [
		'CCRD:74',
	],
	'多发性硬化': [
		'CCRD:76',
	],
	#'多系统萎缩): [''],
	'强直性肌营养不良': [
		'CCRD:78',
	],
	'N-乙酰谷氨酸合成酶缺乏症': [
		'CCRD:79',
	],
	'新生儿糖尿病': [
		'CCRD:80',
	],
	'视神经脊髓炎': [
		'CCRD:81',
	],
	#'尼曼匹克病A型': [''],
	#'尼曼匹克病B型': [''],
	#'尼曼匹克病C型': [''],
	'非综合征性耳聋': [
		'CCRD:83',
	],
	'Noonan 综合征': [
		'CCRD:84',
	],
	'鸟氨酸氨甲酰胺基转移酶缺乏症': [
		'CCRD:85',
	],
	'成骨不全症': [
		'CCRD:86',
	],
	'帕金森病': [
		'CCRD:87',
	],
	#'阵发性睡眠性血红蛋白尿症': [''],
	'黑斑息肉综合征': [
		'CCRD:89',
	],
	'苯丙酮尿症': [
		'CCRD:90',
	],
	#'POEMS 综合征': [''],
	#'卟啉病': [''],
	#'Prader-Willi 综合征': [''],
	#'原发性联合免疫缺陷病': [''],
	'原发性遗传性肌张力不全': [
		'CCRD:95',
	],
	#'原发性轻链型淀粉样变': [】,
	'进行性家族性肝内胆汁淤积症': [
		'CCRD:97',
	],
	'进行性肌营养不良': [
		'CCRD:98',
	],
	'丙酸血症': [
		'CCRD:99',
	],
	#'肺泡蛋白沉积症': [''],
	'囊性纤维化': [
		'CCRD:101',
	],
	'视网膜色素变性': [
		'CCRD:102',
	],
	'视网膜母细胞瘤': [
		'CCRD:103',
	],
	'重症先天性粒细胞缺乏症': [
		'CCRD:104',
	],
	'婴儿严重肌阵挛性癫痫': [
		'CCRD:105',
	],
	'镰刀型细胞贫血病': [
		'CCRD:106',
	],
	'Silver－Russell  综合征': [
		'CCRD:107',
	],
	'谷固醇血症': [
		'CCRD:108',
	],
	'脊髓延髓肌萎缩症': [
		'CCRD:109',
	],
	#'脊髓性肌萎缩症': [''],
	#'脊髓小脑性共济失调': [''],
	#'系统性硬化症': [''],
	'四氢生物蝶呤缺乏症': [
		'CCRD:113',
	],
	#'结节性硬化症': [''],
	'酪氨酸血症I型': [
		'CCRD:115.1',
	],
	'极长链酰基辅酶 A 脱氢酶缺乏症': [
		'CCRD:116',
	],
	'威廉姆斯综合征': [
		'CCRD:117',
	],
	'湿疹血小板减少伴免疫缺陷综合征': [
		'CCRD:118',
	],
	'肾上腺脑白质营养不良': [
		'CCRD:119',
	],
	'X-连锁无丙种球蛋白血症': [
		'CCRD:120',
	],
	'X-连锁淋巴增生症':[
		'CCRD:121',
	],

}

if __name__ == '__main__':
	def no_strip(s):
		return len(s) == len(s.strip())
	def no_repeat(s):
		return len(set(s)) == len(s)
	def check():
		d = CLASS_TO_CCRD
		for diag_str, diag_codes in d.items():
			assert no_strip(diag_str)
			for diag_code in diag_codes:
				assert no_strip(diag_code)
			assert no_repeat(diag_codes)
	check()